# coding=windows-1251

def Title():
    print("-------------------------------")
    print("«Колден: История Лучшего»")
    print("-------------------------------")

def Introduction():
    print("-------------------------------")
    Author = "Автор проекта: Julian Loki"
    Programmer = "Генеральный программист: Julian Loki"
    Scenary = "Сценаристы: Julian Loki, Koledloda"
    LinkForSupport = "Ссылка для поддержки: www.donationalerts.com/r/ton618"
    print(Author)
    print(Programmer)
    print(Scenary)
    print(LinkForSupport)
    print("-------------------------------")

def InfoMainCharacters():
    class Hero:
        Name = "Колден"
        Age = "16"
        Hobby = "GameDesign"
        MainCharacterInfo = [Name, Age, Hobby]
  
    H = Hero() # присваивание к переменной класса Hero

def Story():
    print("-------------------------------")
    print("Сюжет:")
    print("Вы - Колден. Студент первого курса, учащийся на программиста. История вашей жизни крутится вокруг технологий и прогресса человечества. В дальнейшем вы хотите стать требовательным специалистом в своей сфере... Однако происходит государственный кризис, после чего все ваши надежды рушатся и жизнь обретает новые краски.")
    print("-------------------------------")


def Game():
    def Day1():
        print("-------------------------------")
        print("День 1. 2023 год.")
        print("1 сентября. Первый учебный день после жаркого лета, я проснулся от яркого света солнца.")
        print("Чем бы заняться?")
        print("1. Пойти на кухню.")
        print("2. Сесть за компьютер.")
        print("3. Пойти на учёбу.")

        while True:
            try:
                action = int(input())
                break
            except ValueError:
                print("Вы ввели не то")
                
        if action == 1:
            print("-------------------------------")
            print("Зайдя на кухню, я заметил, что тарелка кошки пуста.")
            print("Насыпать порцию корма?")
            print("1. Да")
            print("2. Нет")
            print("3. Уйти с кухни")
            
            while True:
                try:
                    a = int(input())
                    break
                except ValueError:
                    print("Такого значения не существует")
                     
            if a == 1:
                print("Я, как заботливый хозяин, достал из шкафа пакетик сухого корма и содержимое высыпал в тарелочку ^-^")
                print("После чего открыл холодильник, достал приготовленное мной вчера блюдо, разогрел, после чего славно поел.")
                print("*Вышел с кухни*")
            elif a == 2:
                print("Если честно, то мне сейчас не до этого, как-нибудь потом...")
                print("Я открыл холодильник, достал приготовленное мной вчера блюдо, разогрел, после чего славно поел.")
                print("*Вышел с кухни*")
            elif a == 3:
                print("Мне сейчас не нужна кухня.") 
                print("*Вышел с кухни*")
            print("-------------------------------")

        elif action == 2:
            print("-------------------------------")
            print("Вы сели за свой компьютер. Что выбрать?")
            print("1. Поиграть в игру")
            print("2. Слушать музыку")
            print("3. Учить онлайн курсы")
     
            Select = int(input())
            if Select == 1:
                print("Вы решили поиграть в свою либимую игру")
                print("...")
                print("...")
                print("...")
                print("Прошло около 7 часов с момента начала игры. Я понял, что пропустил учебный день...")
            elif Select == 2:
                print("Я запустил свой ПК, открыл Яндекс Браузер, после чего запустил плейлист любимой музыки в ВКонтакте.") 
                print("*Полтора часа спустя...*")
                print("Мне надоела музыка, поэтому я пошёл спать. Zzz...")
            elif action == 3:
                print("Подумав рационально, вы решили пойти на учёбу в свой техникум, где провели несколько часов подряд, изучая программирование.")
            
            print("-------------------------------")
            
        elif action == 3:
            students = ["Колден", "Хинагава", "Тсукимичи", "Фоден", "Аарон", "Рон", "Кейт", "Джек", "Фил", "Мишель"]
            NormalFormatStudents = ", ".join(students)
            teachers = ["Саюри", "Ацуко", "Аяко", "Сумирэ", "Хироко"]
            NormalFormatTeachers = ", ".join(teachers)
            
            print("-------------------------------")
            print("Сегодня у меня учебный день, и я не могу пропустить первые пары. Надо собирать вещи и выдвигаться.")
            print("Так-с, я приехал, что дальше?")
            def select():
                print("1. Посмотреть список учеников и их количество")
                print("2. Посмотреть список преподавателей")
                print("3. Посмотреть расписание пар")
            
                while True:
                    try:
                        action = int(input())
                        break
                    except ValueError:
                        print("Вы ввели не то")
                    
                if action == 1:
                    print("-------------------------------")
                    print("Список моих одногруппников:")
                    print(NormalFormatStudents)
                    print("Количество моих одногруппников:")
                    print(len(students))
                    print("-------------------------------")
                elif action == 2:
                    print("-------------------------------")
                    print("Список моих преподавателей:")
                    print(NormalFormatTeachers)
                    print("Количество моих преподавателей:")
                    print(len(teachers))
                    print("-------------------------------")
                elif action == 3:
                    print("-------------------------------")
                    



                    print("-------------------------------")
                select()
            select()
            print("*После учебного дня*")
            print("Фух, этот день был таким насыщенным! Я познакомился со своими преподавателями и новыми друзьями. Думаю мы будем лучшими друзьями :)")
            print("Я лёг спать, так и не поужинав")
            print("-------------------------------")
            
    def Day2():
        ...
    Day1()
        
def Menu():
    print("1. Начать игру")
    print("2. Сюжет")
    print("3. Разработчики")
    print("4. Выйти из игры")
        
    while True:
            try:
                Select = int(input())
                break
            except ValueError:
                print("Вы ввели не то")
                
    if Select == 1:
        Game()
    elif Select == 2:
        Story()
        Menu()
    elif Select == 3:
        Introduction()
        Menu()
    elif Select == 4:
        print("До встречи!")
        exit()
    elif Select != 1 or 2 or 3 or 4:
        print("Вы ввели несуществующий пункт, попробуйте ввести 1, 2 или 3.")
        Menu()                

Title()
Menu()

