# coding=utf-8
import time
import colorama
from colorama import Fore, Back, Style

def Introduction():
    print("-------------------------------")
    Author = "Автор проекта: Julian Loki"
    Programmer = "Генеральный программист: Julian Loki"
    Scenary = "Сценаристы: Julian Loki, Koledloda"
    LinkForSupport = "Ссылка для поддержки: www.donationalerts.com/r/ton618"
    print(Back.LIGHTBLACK_EX + Author)
    print(Programmer)
    print(Scenary)
    print(LinkForSupport + Back.BLACK)
    print("-------------------------------")

def InfoMainCharacters():
    Name = "Колден"
    Age = "16"
    Hobby = "GameDesign"
    MainCharacterInfo = [Name, Age, Hobby]
    

def Story():
    print("-------------------------------")
    print(Fore.GREEN + "Сюжет:")
    story = Fore.YELLOW + "Вы - Колден. Студент первого курса, учащийся на программиста. \nИстория вашей жизни крутится вокруг технологий и прогресса человечества. \nВ дальнейшем вы хотите стать требовательным специалистом в своей сфере... \nОднако происходит государственный кризис, после чего все ваши надежды рушатся и жизнь обретает новые краски.\n"
   
    for char in story:
        print(char, end = "", flush = True)
        time.sleep(0.08)
    print("-------------------------------")


def Game():
    def Day1():
        print("-------------------------------")
        begin = Fore.YELLOW + "День 1. 2023 год. \n1 сентября. Первый учебный день после жаркого лета, я проснулся от яркого света солнца.\nЧем бы заняться?\n" + Fore.WHITE
        for char in begin:
            print(char, end = "", flush = True)
            time.sleep(0.01)
        print("1. Пойти на кухню.")
        print("2. Сесть за компьютер.")
        print("3. Пойти на учёбу.")
        while True:
            try:
                action = int(input())
                break
            except ValueError:
                print("Вы ввели не то")
                
        print("Как будут звать вашего питомца?")
        pet_name = input()
        if action == 1:
            print("-------------------------------")
            InfoMainCharacters()
            message = Fore.YELLOW + f"Зайдя на кухню, я заметил, что тарелка \"{pet_name}\" пуста. \n"
            for char in message:
                print(char, end = "", flush = True)
                time.sleep(0.01)
            petfood = Fore.YELLOW + "Насыпать порцию корма? \n" + Fore.WHITE
            for char in petfood:
                print(char, end = "", flush = True)
                time.sleep(0.01)
            print("1. Да")
            print("2. Нет")
            print("3. Уйти с кухни")
            
            while True:
                try:
                    a = int(input())
                    break
                except ValueError:
                    print("Такого значения не существует")
                     
            if a == 1:
                print("-------------------------------")
                text = Fore.YELLOW + "Я, как заботливый хозяин, достал из шкафа пакетик сухого корма и содержимое высыпал в тарелочку ^-^ \n\
После чего открыл холодильник, достал приготовленное мной вчера блюдо, разогрел, после чего славно поел.\n\
*Вышел с кухни* \n" + Fore.WHITE
                for char in text:
                    print(char, end = "", flush = True)
                    time.sleep(0.01)
                tech()
            elif a == 2:
                print("Если честно, то мне сейчас не до этого, как-нибудь потом...")
                print("Я открыл холодильник, достал приготовленное мной вчера блюдо, разогрел, после чего славно поел.")
                print("*Вышел с кухни*")
            elif a == 3:
                print("Мне сейчас не нужна кухня.") 
                print("*Вышел с кухни*")
            print("-------------------------------")

        elif action == 2:
            print("-------------------------------")
            print("Вы сели за свой компьютер. Что выбрать?")
            print("1. Поиграть в игру")
            print("2. Слушать музыку")
            print("3. Учить онлайн курсы")
     
            Select = int(input())
            if Select == 1:
                print("Вы решили поиграть в свою либимую игру")
                print("...")
                print("...")
                print("...")
                print("Прошло около 7 часов с момента начала игры. Я понял, что пропустил учебный день...")
            elif Select == 2:
                print("Я запустил свой ПК, открыл Яндекс Браузер, после чего запустил плейлист любимой музыки в ВКонтакте.") 
                print("*Полтора часа спустя...*")
                print("Мне надоела музыка, поэтому я пошёл спать. Zzz...")
            elif action == 3:
                print("Подумав рационально, вы решили пойти на учёбу в свой техникум, где провели несколько часов подряд, изучая программирование.")
            
            print("-------------------------------")
            
        elif action == 3:
                tech()
                select()
                print("*После учебного дня*")
                print("Фух, этот день был таким насыщенным! Я познакомился со своими преподавателями и новыми друзьями. Думаю мы будем лучшими друзьями :)")
                print("Я лёг спать, так и не поужинав")
                print("-------------------------------")
            
    def Day2():
        ...
    Day1()

def tech():
    students = ["Колден", "Хинагава", "Тсукимичи", "Фоден", "Аарон", "Рон", "Кейт", "Джек", "Фил", "Мишель"]
    NormalFormatStudents = ", ".join(students)
    teachers = ["Саюри", "Ацуко", "Аяко", "Сумирэ", "Хироко"]
    NormalFormatTeachers = ", ".join(teachers)
    print("-------------------------------")
    text = Fore.YELLOW + "Сегодня у меня учебный день, и я не могу пропустить первые пары. Надо собирать вещи и выдвигаться. \n\
*Какое-то время спустя...* \n\
Так-с, я приехал, что дальше? \n" + Fore.WHITE
    for char in text:
        print(char, end = "", flush = True)
        time.sleep(0.01)
    def select():
        print("1. Посмотреть список учеников и их количество")
        print("2. Посмотреть список преподавателей")
        print("3. Посмотреть расписание пар")
            
        while True:
            try:
                action = int(input())
                break
            except ValueError:
                print("Вы ввели не то")
                    
        if action == 1:
            print("-------------------------------")
            print(Fore.BLUE + "Список моих одногруппников:" + Fore.WHITE)
            print(NormalFormatStudents)
            print(Fore.BLUE + "Количество моих одногруппников:" + Fore.WHITE)
            print(len(students))
            print("-------------------------------")
            text = Fore.YELLOW + "Ого, в моей группе как-то маловато людей, по сравнению с той же школой... \n\
Интересно - какие мои одногруппники? \n\
Надеюсь они дружелюбные, потому что не хотелось бы с самого начала иметь плохие отношения... \n\
Не стоит забывать, что всё нужно стараться решать пробелемы словами, иначе будут неприятности. \n\
Я хочу успешно выпуститься из техникума со 100% умением программировать и вести проекты. \n\
Главное не расскрывать своё прошлое другим, ни в коем случае... Иначе... \n\
*Стук по плечу* \n\
- Приветики! Как тебя зовут? - ??? \n\
- Ой, ты напугала меня... - Колден \n\
- Прости-прости, я не хотела. Так как тебя зовут? Я просто ищу своих одногруппников, но пока никого из них не нашла... - ??? \n\
О чём она вообще думала, когда так резко возникла из ниоткуда?... \n\
- Ладно, ничего страшного. Меня зовут Колден, а тебя? - Колден \n\
- Хм, Колден говоришь? Ты вроде как раз в моей группе. Меня зовут Хинагава, приятно познакомиться! - Хинагава, дружелюбно наклонившись \n\
Хинагава говоришь... \n\
- О, да, ты точно в моей группе! Я запомнил всех, кто там был. - Колден \n\
- Ничего себе у тебя память 0-о... Я даже за первый месяц не успеваю всех запомнить... - Хинагава в изумлении\n\
- Ну... Наверное, память - мой конёк - Колден, ухмыляясь\n\
- Да уж :0 Ладненько, давай зайдём внутрь техникума, вдруг все наши уже там. - Хинагава \n\
- Погнали, заодно и посмотрим как всё внутри выглядит. - Колден \n\
\n\
Мы отчётливо осмотрелись, и вскоре нашли нашу группу, которая держала табличку с номером нашей группы, \n\
После чего мы тут же подошли к ним, познакомились, а уже потом пошли на первые в этом году пары \n\
*Первый день закончился* \n" + Fore.WHITE
            for char in text:
                print(char, end = "", flush = True)
                time.sleep(0.01)
        elif action == 2:
            print("-------------------------------")
            print("Список моих преподавателей:")
            print(NormalFormatTeachers)
            print("Количество моих преподавателей:")
            print(len(teachers))
            print("-------------------------------")
        elif action == 3:
            print("-------------------------------")
                    



            print("-------------------------------")
    select()


def Menu():
    print(Fore.RED + "1. Начать игру")
    print(Fore.GREEN + "2. Сюжет")
    print(Fore.BLUE + "3. Разработчики" + Fore.WHITE)
    print("4. Выйти из игры")
        
    while True:
            try:
                Select = int(input())
                break
            except ValueError:
                print("Вы ввели не то")
                
    if Select == 1:
        Game()
    elif Select == 2:
        Story()
        Menu()
    elif Select == 3:
        Introduction()
        Menu()
    elif Select == 4:
        print(Fore.BLUE + "\t\t\tДо встречи!")
        print("\t══════════════█▒════════▒█▒══════════════════\n\
        ═════════════▒███▒═══▒██▒▒█════█████═════════\n\
        ═════════════█▒▒▒█▒═██▒▒▒▒█▒████▒▒█▒═════════\n\
        ════════════▒█▒▒▒▒██▒▒▒▒▒▒██▒▒▒▒▒▒█══════════\n\
        ══════███══▒█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒████████▒═══\n\
        ══════██▒█▒█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒═══\n\
        ══════██▒▒█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█═════\n\
        ══════▒█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█████▒═\n\
        ══██████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒███\n\
        ══███▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒═\n\
        ════██▒▒▒▒▒▒▒▒▒▒████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██═══\n\
        ═════▒█▒▒▒▒██████████████▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒██▒\n\
        ═════▒█▒▒█████████████████▒▒██▒█████▒▒▒▒▒▒███\n\
        ═════█▒▒██████████████████▒▒██▒██████▒▒▒▒█▒══\n\
        ═════█▒▒███████████████████▒█████████████════\n\
        ════▒██████████▒▒████▒▒████▒█████████████════\n\
        ════███████████▒█████▒▒██████████████████════\n\
        ════▒▒▒██████████████▒▒▒██████████████▒▒█════\n\
        ════════███████▒█████▒▒███████████▒▒▒██▒█▒═══\n\
        ════════▒████████████████████▒▒▒▒▒▒▒▒█▒▒██═══\n\
        ══════════███████████▒██▒▒▒▒▒▒▒▒▒▒████▒▒███══\n\
        ══════════▒█▒▒██▒▒▒▒▒█▒▒▒█████▒▒▒▒▒██▒▒▒███▒═\n\
        ═══════════█▒▒▒███▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒█▒▒███▒\n\
        ═══════════██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒██▒▒▒████\n\
        ════════════██▒▒▒▒█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█▒███═███\n\
        ═██════███══██▒▒▒▒█▒▒▒▒▒▒▒▒▒▒▒▒█▒▒▒█▒▒███▒═██\n\
        ▒███══▒█▒█▒══██▒▒▒█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█▒██████▒═█\n\
        ▒█▒█▒═▒█▒█▒═══██▒▒██▒▒▒████▒▒▒▒▒▒████████████\n\
        ═█▒▒█══█▒▒█════██▒████████▒▒▒▒▒██████████████\n\
        ═▒█▒▒█═█▒▒█══════█████▒██▒▒▒█████████████████\n\
        ══▒█▒▒▒█▒▒█▒═══════▒█████████████████████████\n\
        ══▒█▒▒▒█▒▒▒█══════════▒▒▒═▒██████████████████\n\
        ═█▒▒█▒▒▒▒▒▒▒█══════════════▒█████████████████\n\
        ▒█▒▒█▒▒▒▒██▒██════════════███████████████████\n\
        ▒█▒▒█▒▒▒▒▒▒▒▒█▒══════════████████████████████\n\
        ▒█▒██▒████▒▒▒▒█═════════█████████████████████\n\
        ▒█▒████▒█▒▒▒▒▒█════════██████████████████████\n\
        ═█▒▒█▒▒▒█▒▒▒▒▒█═══════▒██████████████████████\n\
        ═▒█▒▒▒▒▒▒█▒▒████═════████████████████████████\n\
        ═███▒▒▒▒▒▒▒██████════████████████████████████\n\
        ═█████▒▒█████████════████████████████████████\n\
        ▒█████████████████▒══████████████████████████\n\
        ▒██████████████████▒═▒███████████████████████\n\
        ═████████████████████████████████████████████\n\
        ═══██████████████████████████████████████████\n" + Fore.WHITE)
        exit()
        
    elif Select != 1 or 2 or 3 or 4:
        print("Вы ввели несуществующий пункт, попробуйте ввести 1, 2 или 3.")
        Menu()                
        
def Title():
    print("-------------------------------")
    print(Back.YELLOW + Fore.LIGHTYELLOW_EX + "«Колден: История Лучшего» .DEMO." + Fore.WHITE + Back.BLACK)
    print("-------------------------------")

Title()
Menu()